{
  "publishedAt": "6th Oct 2019",
  "title": "Sitecore Experience Commerce – SyncForce product import",
  "content": "In preparation of my Sitecore Symposium 2019 talk around Sitecore Experience Commerce I created some example customizations/plugins which I want to share upfront.\\\nFirst off is a plugin for integrating the SyncForce PIM and importing its catalog, categories and products into Sitecore Commerce.\n\nWhen creating this product import I wanted to make use of as many building blocks Sitecore XC had to offer as this was actually the first customization I ever did for the product.\\\nThe idea was to use the pipelines, lists and minions as much as possible and use their architectural advantages as a basis for this process.\n\n## The plugin architecture\n\nThe SyncForce structure, or at least as is used for our client, has a SOAP service to get the details for a catalog with all its categories in a single call. The actual product details have to be retrieved by another SOAP call.\\\nThis made me choose for a single command and corresponding pipeline to get the catalog and category data and create that in Sitecore XC.\\\nIn the following diagram you can see the workflow of this part of the integration.\n\n![Sync Catalog Workflow](/images/uploads/create-catalog-workflow.png \"Sync Catalog Workflow\")\n\nAs you can see we created a single pipeline which is responsible for creating the Catalog entity and all the Category entities. The last step (or block) is used to add all the product IDs to a new List. This List is then used by another minion to actually create the SellableItem entities.\\\nWe use this ‘Sync Catalog Command’ practically only once when we setup a new environment, but it can also be used to add all the product IDs to the update list again.\n\nThe next part is of course going through the product ID List and creating or updating the corresponding SellableItems.\n\n![Sync Product Workflow](/images/uploads/create-product-workflow.png \"Sync Product Workflow\")\n\nIn this part a Minion is tasked to watch the product ID List and work through them. For each entry in the List a Pipeline is run to create or update the SellableItem entity. Each step of this Pipeline is responsible for a part of the product details, like properties, variants and assets.\n\nDue to the fact that this is placed in a separate Pipeline, it is very easy to reuse this functionality. You can, for example, create a Command which will run this Pipeline for a specific product instead of always going through a list. Little things like this make it easier for us developers to maintain and test these functionalities.\n\n## The code\n\nNow, what does this actually look like in Plugin form? The example Visual Studio project(s) can be found on GitHub:\\\n<https://github.com/GuidovTricht/Sitecore.Commerce.Plugin.Catalogs.SyncForce>\\\nThis Plugin should be enough to get started and create the base structure of your Catalog. If you decide to use this you might want to extend the SynchronizeProduct Pipeline to import your specific product details."
}